#     Introduction : Occupation Data set

This a data set from this weblink [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user). The data set is a represntation of 943 people from different occupations. The whole data set has been built based on their age, gender, used_id, zip_code, and obviously the occupation. Here in this script, I am going through to have an idea about them.  

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.



### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

### Step 3. Assign it to a variable called users.

In [3]:
users = pd.read_csv(url, delimiter="|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
users.groupby("occupation").mean()

                  user_id        age
occupation
administrator  430.949367  38.746835
artist         451.892857  31.392857
doctor         533.714286  43.571429
educator       466.905263  42.010526
engineer       456.328358  36.388060
entertainment  398.000000  29.222222
executive      422.312500  38.718750
healthcare     501.437500  41.562500
homemaker      443.000000  32.571429
lawyer         359.083333  36.750000
librarian      486.588235  40.000000
marketing      437.807692  37.615385
none           368.666667  26.555556
other          542.733333  34.523810
programmer     435.530303  33.121212
retired        515.714286  63.071429
salesman       494.916667  35.666667
scientist      465.129032  35.548387
student        484.954082  22.081633
technician     497.629630  33.148148
writer         495.711111  36.311111

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [5]:
male_ratio = users.groupby(['occupation', 'gender']).size().unstack().assign(male_ratio=lambda x: x.M / x.sum(axis=1))
male_ratio['male_ratio'].sort_values(ascending = False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: male_ratio, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [6]:
# Alternative solution

#min_age = users.groupby("occupation")["age"].min()
#min_age.head()

#max_age = users.groupby("occupation")["age"].max() 
#max_age.head()

In [7]:
min_age=users.groupby('occupation').agg({'age':'min'})
min_age=min_age.rename(columns={"age":"min_age"})
min_age.head()

               min_age
occupation
administrator       21
artist              19
doctor              28
educator            23
engineer            22

In [8]:
#max_age = users.groupby("occupation")["age"].max()
max_age=users.groupby('occupation').agg({'age':'max'})
max_age = max_age.rename(columns={"age":"max_age"})
#max_age.head()

In [9]:
min_max_age = pd.concat([min_age,max_age], axis=1)
min_max_age

               min_age  max_age
occupation
administrator       21       70
artist              19       48
doctor              28       64
educator            23       63
engineer            22       70
entertainment       15       50
executive           22       69
healthcare          22       62
homemaker           20       50
lawyer              21       53
librarian           23       69
marketing           24       55
none                11       55
other               13       64
programmer          20       63
retired             51       73
salesman            18       66
scientist           23       55
student              7       42
technician          21       55
writer              18       60

In [10]:
col_nam = ["minimum age", "maximu age"]

In [11]:
min_max_age.rename(columns={"min_age":"minimum age", "max_age":"maximum_age"})

               minimum age  maximum_age
occupation
administrator           21           70
artist                  19           48
doctor                  28           64
educator                23           63
engineer                22           70
entertainment           15           50
executive               22           69
healthcare              22           62
homemaker               20           50
lawyer                  21           53
librarian               23           69
marketing               24           55
none                    11           55
other                   13           64
programmer              20           63
retired                 51           73
salesman                18           66
scientist               23           55
student                  7           42
technician              21           55
writer                  18           60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [12]:
users.groupby(["occupation","gender"])["age"].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [13]:
newdf = pd.crosstab(index=users['gender'], columns=users['occupation']).stack()/len(users)

In [14]:
newdf.head()

gender  occupation
F       administrator    0.038176
        artist           0.013786
        doctor           0.000000
        educator         0.027572
        engineer         0.002121
dtype: float64

In [15]:
percentage_data = pd.DataFrame({'Percentage': users.groupby(('occupation', 'gender')).size() / len(users)})
percentage_data.head()

                      Percentage
occupation    gender
administrator F         0.038176
              M         0.045599
artist        F         0.013786
              M         0.015907
doctor        M         0.007423